
#### Terraform Format 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`

<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
Acquiring state lock. This may take a few moments...
data.azurerm_resource_group.mine_server_rg: Reading...
data.azurerm_resource_group.mine_server_rg: Read complete after 0s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg]
data.azurerm_storage_account.mine_server_storage: Reading...
data.azurerm_storage_account.mine_server_storage: Read complete after 1s [id=/subscriptions/b821accf-bbb0-45ec-bdc4-ad636e374794/resourceGroups/mine-server-rg/providers/Microsoft.Storage/storageAccounts/mineserversa]
azurerm_storage_share.mine_file_share: Refreshing state... [id=https://mineserversa.file.core.windows.net/mineserverfileshare]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # azurerm_container_group.mine_server will be created
  + resource "azurerm_container_group" "mine_server" {
      + dns_name_label              = "folly-mine-server"
      + dns_name_label_reuse_policy = "Unsecure"
      + exposed_port                = (known after apply)
      + fqdn                        = (known after apply)
      + id                          = (known after apply)
      + ip_address                  = (known after apply)
      + ip_address_type             = "Public"
      + location                    = "brazilsouth"
      + name                        = "mine-server"
      + network_profile_id          = (known after apply)
      + os_type                     = "Linux"
      + priority                    = "Regular"
      + resource_group_name         = "mine-server-rg"
      + restart_policy              = "Always"
      + sku                         = "Standard"

      + container {
          + commands              = (known after apply)
          + cpu                   = 1
          + environment_variables = {
              + "EULA"              = "true"
              + "MAX_PLAYERS"       = "8"
              + "MODRINTH_LOADER"   = "fabric"
              + "MODRINTH_PROJECTS" = "fabric-api,cobblemon,journeymap,appleskin,dismount-entity,ferrite-core,krypton,lazydfu,lmd,lithium,memoryleakfix,starlight,yosbr,architectury-api,bookshelf-lib,cloth-config,collective,konkrete"
              + "MOTD"              = "Servidor §2Cobblemon §fdos casas"
              + "OPS"               = "GR8B8_"
              + "PVP"               = "false"
              + "TYPE"              = "FABRIC"
              + "VERSION"           = "1.20.1"
            }
          + image                 = "itzg/minecraft-server"
          + memory                = 4
          + name                  = "mine-container"

          + ports {
              + port     = 25565
              + protocol = "TCP"
            }
          + ports {
              + port     = 25575
              + protocol = "TCP"
            }
          + ports {
              + port     = 445
              + protocol = "TCP"
            }

          + volume {
              + empty_dir            = false
              + mount_path           = "/data"
              + name                 = "mine-volume"
              + read_only            = false
              + share_name           = "mineserverfileshare"
              + storage_account_key  = (sensitive value)
              + storage_account_name = "mineserversa"
            }
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
Releasing state lock. This may take a few moments...

```

</details>

*Pusher: @mfollypp, Action: `pull_request`, Workflow: `Terraform`*